## Learn Pandas :-

In [1]:
import pandas as pd

### Dataframe :-

In [34]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["A", "B", "C"], index = ["x","y","z"])

In [35]:
df.head() # Shows all Row Data

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [36]:
df.tail(1) # Last rows

   A  B  C
z  7  8  9

In [39]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [38]:
df.index.tolist()

['x', 'y', 'z']

In [40]:
df.info() # give information

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [41]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [33]:
df.shape

(3, 3)

### Loading in Dataframes form Files :-

In [ ]:
coffee = pd.read_csv('./coffee.csv')
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35